#Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. 
#Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. 
#Выведите минимальное количество монет, которые нужно перевернуть

num = int(input("Введите количество монет: "))
from random import randint
temp = -1
orel = 0
reshka = 0

for i in range(num):
    temp = randint(0, 1)
    if temp == 0:
        orel = orel + 1
    else:
        reshka = reshka + 1
    print(temp)
if orel > reshka:
    print("Нужно перевернуть", {reshka}, "монет с решкой")
else:
    print("Нужно перевернуть", {orel}, "монет с орлом")