# Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. 
# Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. 
# Он называет сумму этих чисел S и их произведение P. Помогите Кате отгадать задуманные Петей числа.

sum = int(input("Введите сумму чисел: "))
prod = int(input("Введите произведение чисел: "))

for x in range(sum):
    for y in range(prod):
        if sum == x + y and prod == x * y:
            print("Первое число:", x, " Второе число:", y,)